Dlubal.DynamPro.ErrorType
Type of error

Dlubal.DynamPro.ErrorType.UnknownErrorType
Unknown error

Dlubal.DynamPro.ErrorType.UserErrorType
User error

Dlubal.DynamPro.ErrorType.InternalErrorType
Internal error

Dlubal.DynamPro.ErrorType.WarningType
Warning

Dlubal.DynamPro.ErrorType.CalculationErrorType
Calculation error